export interface SakeDescription {
  title?: string
  itemInfo: string
  introduction: string
  recommendation: string
}

const chnSakeDescriptions: SakeDescription[] = [
  {
    title: 'MONACO SAKE AWARD2023 吟釀酒部門獲得金獎',
    itemInfo: `- **酒精度:** 14.8%
- **酸度:** 1.5
- **容量:** 720ml
- **推薦的飲用方式:** 冷酒・溫熱`,
    introduction:
      '發掘「越乃雪藏」純米吟釀的精粹，這款贏得2023年MONACO SAKE AWARD金獎的日本酒， 以14.8%的酒精度和1.5的酸度，為您帶來恰到好處的酸味與清新口感。720ml的越乃雪藏， 不論冷飲或微溫，均能與各式美食完美搭配，提升您餐桌上的味道體驗。 從輕食如蕎麥麵、壽司，到日常餐點或特殊慶典，它的淡雅香醇與親民價格， 讓它成為獨特的選擇。一杯越乃雪藏，溫暖您的身心，讓每一口都轉化為味蕾的慶祝。',
    recommendation: `**適合任何料理的淡麗辛口**
- 在日本，常與蕎麥麵或壽司等一起飲用。 

**適合任何場合的酒**
- 雖然設計高級，但價格合理，適合日常用餐或稍微奢侈的日子。 

**溫暖身體的熱酒**
- 在日本，將日本酒加熱至40~50°C飲用。這種飲用方式不僅能暖和身體，還能變化味道。越後雪藏即使是溫熱也很美味。 
`
  },
  {
    title: '法國舉行 2023 KURA MASTER 的日本酒評比 中獲得金獎',
    itemInfo: `- **酒精度:** 16%
- **酸度:** 1.3
- **容量:** 720ml
- **推薦的飲用方式:** 冷酒5~10°C、常溫或溫酒(約40°C)`,
    introduction:
      '田友純米吟釀，採用100%新潟「越淡麗」酒米，契約種植於豐饒土地，精釀而成。 溫和米香與淡雅甜味，酒精度16%，酸度1.3，720ml純釀之美。適合5~10°C冷酌或40°C溫餐， 與海老天婦羅或牛舌完美搭配，冷暖皆宜，風味獨特。 2023 KURA MASTER日本酒評比金獎得主，是對我們釀造工藝與「越淡麗」米質的高度認可。 田友純米吟釀，每一口都是對自然與細節的致敬，為您的每一個時刻帶來不凡品味。 立即體驗這款匠心釀造的金獎佳釀。',
    recommendation: `**100%使用「越淡麗」**
- 使用100%在自然環境豐富的魚沼小千谷地區，通過契約種植方式栽培的新潟縣限定酒米「越淡麗」。 

**略帶甜味**
- 越淡麗是製作大吟釀酒的選用酒米。它雖然酒味較重，但仍能嚐到米的柔和甜味，因此非常受女性喜愛。 

**不論冷飲或暖飲都美味**
- 冷飲時，其香氣清新，口感爽口;溫飲時，香氣更加突出，味道更加豐富。田友即使是熱飲也同樣美味。 
`
  },
  {
    itemInfo: `- **酒精度:** 16%
- **酸度:** 1.4
- **容量:** 720ml
- **推薦的飲用方式:** 冷酒5~10°C、常溫或溫酒(約40°C)`,
    introduction:
      '越之初梅純米清爽，16%酒精度，720ml裝，用心釀造出米的溫和甜味。 無論搭配炸物或含香蔬的料理，均能提升美食體驗。冷酒時清新爽口，溫酒時香氣濃郁， 適宜於任何場合，是家庭聚餐與友人小聚的理想之選。越之初梅，讓日常餐桌煥發非凡風味。',
    recommendation: `**適合搭配各式料理的淡麗辛口**
- 在日本，這款酒經常被用來搭配炸物或刺身等美食。

**適合日常餐飲**
- 因為價格實惠，這款酒成為了日本人日常飲用的選擇。

**冷熱兩飲皆宜**
- 冷飲能夠享受到其清新的香氣和爽口的味道。加熱後，香氣更加濃郁，味道更顯豐富。即便是熱飲也同樣美味。 
`
  },
  {
    title: '2023年葡萄酒杯中美味的日本酒大獎',
    itemInfo: `- **酒精度:** 15%
- **酸度:** 1.2
- **容量:** 720ml
- **推薦的飲用方式:** 冷酒5~10°C、常溫`,
    introduction:
      '體驗高之井純米大吟釀的獨特魅力，一款融合純正米香和深沉甜味的獲獎日本酒。 這款純米大吟釀榮獲2023年葡萄酒杯日本酒大獎金獎，專為細膩魚料理如紅肉魚或 烤鮭魚設計，提供15%的完美酒精度和1.2的理想酸度。以5~10°C冷酒品鑑， 揭開其香氣和味道的完美層次。 適合慶典、送禮，高之井純米大吟釀是您品味生活的精緻選擇。',
    recommendation: `**特殊日子的選擇**
- 擁有高雅的香氣和豐富的味道，使用葡萄酒杯飲用時，香氣尤其突出。適合慶祝或約會時品嚐。 

**作為禮物的最佳選擇**
- 其擁有高級感的金色標籤和包裝盒，使其成為日本熱門的禮物選擇。 

**推薦冷飲**
- 大吟釀酒通常推薦冷飲。由於香氣濃郁，冷飲更能提升其飲用體驗。 
`
  },
  {
    itemInfo: `- **酒精度:** 14%
- **酸度:** 非公開
- **容量:** 720ml
- **推薦的飲用方式:** 冷酒12~15°C、常溫`,
    introduction:
      '「深然 - MIZEN」純米大吟釀——2023年3月新品，匠心釀造，融合傳統與創新。 這款清酒以其獨特的二段釀造法，展現出清新風味、豐富香氣與柔和甜美的口感。 酒精度14%，在每一口的終點帶來清爽的享受。 特別推薦與精緻的日本料理如生魚片搭配，「深然 - MIZEN」的風味能完美襯托食物的細膩。 建議在12°C至15°C冷飲享用，以體驗其最佳風味。720ml容量，適合家庭分享或作為精緻禮物。 開啟一瓶「深然 - MIZEN」，讓清新的香氣與優雅的口感，為您的每一刻增添不凡的味覺享受。 立即品嚐，探索清酒的新境界。',
    recommendation: `**採用二段釀造法，以提取清爽的風味**

**餐酒搭配**
- 適合於餐前乾杯用以及用餐時飲用的日本清酒，擁有水果般芳醇的香氣和優雅的甜味，酸味溫和且口感爽利，收尾清爽，特別適合搭配生魚片等清淡的料理。 

**冷飲更佳**
- 不適合太過於低溫，建議在12°C至15°C的溫度下享用，更能品嚐到香氣和優雅的甜味的完美融合。`
  },
  {
    title: '日本國內的銷售店僅在新潟縣內的兩個地方的珍藏酒',
    itemInfo: `- **原料米:** 新瀉縣產 山田錦
- **酒精度:** 15%
- **精米步合:** 50％
- **酸度:** 1.4
- **容量:** 300ml、720ml
- **推薦的飲用方式:** 冷酒`,
    introduction:
      '潟王是一款高級的日本酒，其尊貴的口感非常適合用於慶祝重要時刻或特殊的日子。這款酒特別適合搭配魚類或日式和食料理。潟王不僅在味道上追求極致，在包裝上也同樣精緻。使用日本獨特的技術製作標籤，並採用類似於iPhone包裝盒的高級材質製成精美的盒子，使其成為送禮的上佳選擇。此外，潟王是一款限定生產的商品，全日本僅在新潟縣內的兩個地方有售，使其更顯珍貴。潟王的果香豐富且口感清爽，是一款辛口的日本酒，推薦以冷酒方式飲用，以最佳方式享受其獨特風味。',
    recommendation: `**用日本酒乾杯**
- 潟王是日本高級的酒之一。其高貴的味道非常適合慶祝時刻或特別的日子。

**餐酒搭配**
- 適合搭配魚或是日本和食料理。 

**適合用於送禮**
- 這是一款在標籤和包裝盒上都充滿講究的商品。使用日本特有技術製作的標籤，以及用於iPhone包裝盒的材料製成的盒子。外觀上擁有高級感。`
  }
]

const chnSakeSubtitles = [
  '風味絕佳的金獎之選',
  '自然之選 品味之美',
  '清新搭配 日常佳釀',
  '頂級選擇 甜美相伴',
  '清新風味的新境界',
  '純米大吟釀 雪中貯藏'
]

const serviceImages = [
  '/images/日本酒/越乃雪藏.webp',
  '/images/日本酒/田友.webp',
  '/images/日本酒/越之初梅.webp',
  '/images/日本酒/高之井.webp',
  '/images/日本酒/深然.webp',
  '/images/日本酒/瀉玉.webp'
]

export const sakes = {
  chn: ['越乃雪藏', '田友', '越之初梅', '高之井', '深然', '瀉玉'],
  getSakeInfoList() {
    const sakeTitles = this.chn
    const sakeDescriptions = chnSakeDescriptions
    const sakeSubtitles = chnSakeSubtitles
    const id = ['yukikura', 'dennyu', 'hatsuume', 'takanoi', 'ginjo', 'gatao']
    const isHot = [false, true, false, false, false, true]
    return sakeTitles.map(
      (title, idx) =>
        ({
          title,
          subtitle: sakeSubtitles[idx],
          isHot: isHot[idx],
          id: id[idx],
          description: sakeDescriptions[idx],
          images: [serviceImages[idx]]
        }) as SakeInfo
    )
  }
}

export interface SakeInfo {
  title: string
  isHot: boolean
  subtitle?: string
  id: string
  description: SakeDescription
  images: string[]
}
